"use strict";

/*
Необходимо попросить пользователя ввести число.
Если пользователь ввел отличное от числа значение, необходимо вывести в консоль
строку: "Значение задано неверно", иначе необходимо будет вызвать функцию 
(нужно будет ее создать), которая будет принимать введенное пользователем 
число. Функция должна вычесть из переданного ей числа 13% и вывести в консоль 
сообщение "Размер заработной платы за вычетом налогов равен N."
*/

// function calculateSalary(number) {
//     const result = number - (number * 0.13);
//     console.log(`Размер зарабатной платы за вычетом налогов равен ${result}.`);
// }

// const input = prompt('Введите число');

// if (isNaN(input)) {
//     console.log("Значение задано неверно");
// } else {
//     const num = Number.parseFloat(input);
//     calculateSalary(num)
// }
